#pragma once
#include<QWidget>

//类简介
//英雄技能 继承自card类 相当于一张常驻的指向性性法术牌
//为什么不能是非指向性法术牌? 
//因为非指向性法术牌在card类中已实现鼠标交互模式 需要拖动卡牌 与英雄技能点击使用的逻辑不符 如果后续能开发出非指向性再说
//默认法力值消耗为2点 每回合用一次
//英雄技能的显示和法术牌不同 需要在初始化时更改外观 如果可以 把形状改成圆形 
#include"card.h"
class object;
class ability :
    public card
{
    //构造函数----------------------------------------------------------------------------------------------------
public:
    ability(int _cost, void (*_dirfp)(QPoint target), std::string _name, QWidget* parent);//初始化指向性技能
    

    //数据成员----------------------------------------------------------------------------------------------------
private:
    bool alive;//是否可用 一回合只能用一次


    //成员函数----------------------------------------------------------------------------------------------------
public:
    void refresh();//回合开始 刷新技能的使用次数



    //信号与槽----------------------------------------------------------------------------------------------------
signals:
    void useability(ability* a,QPoint pos);

};

